app/Helpers/transcribe_helper.php

SELECT *
FROM `freecomett_detail_data`
WHERE `BMD_header_index` = '317'
AND `BMD_identity_index` = '7630'
AND `project_index` = '1'
ORDER BY `BMD_line_sequence` ASC
---
	function transcribe_initialise_step1($start_message, $controller, $controller_title)
	{
		$session = session();
		$detail_data_model = new Detail_Data_Model();
		$def_ranges_model = new Def_Ranges_Model();
		$transcription_detail_def_model = new Transcription_Detail_Def_Model();
		$transcription_comments_model = new Transcription_Comments_Model();

		// get all existing details for this header
		$session->transcribe_detail_data = $detail_data_model
			->where('BMD_header_index',  $session->current_transcription[0]['BMD_header_index'])
			->where('BMD_identity_index', $session->BMD_identity_index)
			->where('project_index', $session->current_project[0]['project_index'])
			->orderby('BMD_line_sequence','ASC')
			->findAll();

SELECT *
FROM `freecomett_def_ranges`
WHERE `data_entry_format` = 'marriages_1'
---
					$session->set('table_title', $controller_title);

					// get the current data entry format for this transcription
					$session->def_range = $def_ranges_model
						->where('data_entry_format', $session->current_allocation[0]['data_entry_format'])
						->findAll();