app/Controllers/Transcribe.php

			if ( $last_indexes )
				{
					// record found, so update
					$identity_last_indexes_model
						->where('identity_index', $session->BMD_identity_index)
						->where('project_index', $session->current_project[0]['project_index'])
						->where('data_entry_format', $session->current_allocation[0]['data_entry_format'])
						->set(['transcription_index' => $session->current_transcription[0]['BMD_header_index']])
						->set(['allocation_index' => $session->current_transcription[0]['BMD_allocation_index']])
						->set(['syndicate_index' => $session->current_transcription[0]['BMD_syndicate_index']])
						->update();
---
UPDATE `freecomett_identity_last_indexes` SET `transcription_index` = '319', `allocation_index` = '1000065', `syndicate_index` = '100'
WHERE `identity_index` = '7630'
AND `project_index` = '1'
AND `data_entry_format` = 'deaths_5'